Revit 2027 API
NavisworksExportOptions.ConvertLights Property
 True to convert lights, false otherwise. Default value is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ConvertLights { get; set; }
Public Property ConvertLights As Boolean
	Get
	Set
public:
property bool ConvertLights {
	bool get ();
	void set (bool value);
}
member ConvertLights : bool with get, set
Property Value
Boolean
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace